#include "Cat.hpp"
#include "Dog.hpp"

int main()
{
	Animal *zoo[10];
	std::cout << "CREATION" << std::endl;
	for (int i = 0; i < 10; i++)
	{
		std::cout << "__________________________________________________________________________________________" << std::endl;
		if (i % 2)
			zoo[i] = new Cat();
		else
			zoo[i] = new Dog();
	}
	std::cout << "__________________________________________________________________________________________" << std::endl;
	std::cout << "TALKING" << std::endl;
	for (int i = 0; i < 10; i++)
	{
		std::cout << "__________________________________________________________________________________________" << std::endl;
		zoo[i]->makeSound();
	}
	std::cout << "__________________________________________________________________________________________" << std::endl;
	std::cout << "CARNAGE" << std::endl;
	for (int i = 0; i < 10; i++)
	{
		std::cout << "__________________________________________________________________________________________" << std::endl;
		delete zoo[i];
	}
	std::cout << "__________________________________________________________________________________________" << std::endl;
	std::cout<< std::endl << "DEEP COPY TEST" << std::endl;
	std::cout << "__________________________________________________________________________________________" << std::endl;
	Cat *cat = new Cat("Lisa");
	//костыль для задержки времени
	int i = 0;
	while (i < 1000000000)
	{
		i--;
		i += 2;
	}
	//костыль для задержки времени
	Cat *kitty = new Cat();
	std::cout << "__________________________________________________________________________________________" << std::endl;
	std::cout << std::endl << cat->getType() << " says: ";
 	cat->goodIdea(42);
	std::cout << kitty->getType() << " says: ";
	kitty->goodIdea(42);
	std::cout << std::endl;
	*kitty = *cat;
	std::cout << std::endl << cat->getType() << " says: ";
 	cat->goodIdea(42);
	std::cout << "__________________________________________________________________________________________" << std::endl;
	delete cat;
	std::cout << "__________________________________________________________________________________________" << std::endl;
	std::cout << kitty->getType() << " says: ";
	kitty->goodIdea(42);
	std::cout << std::endl;
	std::cout << "__________________________________________________________________________________________" << std::endl;
	std::cout<< std::endl << "MIND STORM" << std::endl;
	for (int i = 0; i < 100; i++)
	{
		std::cout << "__________________________________________________________________________________________" << std::endl;
		kitty->goodIdea(i);
	}
	std::cout << "__________________________________________________________________________________________" << std::endl;
	delete kitty;
	std::cout << "__________________________________________________________________________________________" << std::endl;
}